[
  {
    "name": "Tissot PRX Watch",
    "company": "Tissot",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100041404/main/large/T1374101104100.jpg",
    "gender": "Man",
    "price": 320.0,
    "description": "Tissot PRX T1374101104100 is a functional and special Gents watch from PRX collection. Case is made out of Stainless Steel and the Blue dial gives the watch that unique look. In regards to the water resistance, the watch has a water resistance of 100 metres. This makes it suitable for swimming, but not high impact water sports. The watch is shipped with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Tissot Chrono XL Chronograph Watch",
    "company": "Tissot",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100036751/main/large/T1166173705100.jpg",
    "gender": "Man",
    "price": 340.0,
    "description": "Exclusive to WatchShop, the Tissot Chrono XL Chronograph watch makes a big statement with its cool looks and on-trend style. The Tissot Chrono XL Exclusive Chronograph watch strikes the perfect balance between informal and smart with its low-key fabric strap and powerful black-and-blue colour scheme. Hard-wearing sapphire glass keeps it looking good as new, while the luminescent hands mean the watch looks great even when the sun goes down. Sporty, sophisticated, stylish – what more do you need? ",
    "features": [
      "Water-resistant to 100m, great for swimming and water sports",
      "Chronograph function for elapsed time measurement, adding functionality",
      "Luminescent hands, allowing for easy time-reading in the dark",
      "Powered by a quartz watch movement for superb time accuracy"
    ]
  },
  {
    "name": "Tissot Supersport Chronograph Watch",
    "company": "Tissot",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100047178/main/large/T125_617_11_041_00.jpg",
    "gender": "Man",
    "price": 435.0,
    "description": "Tissot Supersport T1256171104100 is a practical and attractive Gents watch from Supersport collection. Case material is Stainless Steel while the dial colour is Blue. The features of the watch include (among others) a chronograph. 100 metres water resistance will protect the watch and allows it to get submerged in the water for everyday usage including swimming, but not high impact water sports. The watch is shipped with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Tissot Tradition Automatic Automatic Automatic Watch",
    "company": "Tissot",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100040601/main/large/T0634282203800.jpg",
    "gender": "Man",
    "price": 518.0,
    "description": "Mens Tissot Tradition Automatic Watch T0634282203800"
  },
  {
    "name": "Ladies Tissot Lovely Square Watch",
    "company": "Tissot",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100031771/main/large/T058_109_33_031_00.jpg",
    "gender": "Woman",
    "price": 340.0
  },
  {
    "name": "Ladies Tissot Everytime Watch",
    "company": "Tissot",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100048735/main/large/T143_210_11_011_00.jpg",
    "gender": "Woman",
    "price": 247.0,
    "description": "Tissot Everytime T1432101101100 is an incredible attractive Ladies watch. Case material is Stainless Steel while the dial colour is Silver. 50 metres water resistancy will protect the watch and allows it to be submerged in water for periods, so can be used for swimming and fishing. It is not recommended for high impact water sports. The watch is shipped with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Emporio Armani Watch AR11227",
    "company": "Emporio Armani",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100034253/main/large/AR11227.jpg",
    "gender": "Man",
    "price": 204.0,
    "description": "This Gents Giovanni Emporio Armani Watch is a colourful designer timepiece with high class. The gorgeous deep-blue dial contrasts with the elegant silver hour markers, which feature Roman numerals and the iconic Armani logo at 12 o’clock. There’s a discreet date window at 6 o’clock, and a polished stainless steel bracelet with butterfly clasp to complete the look. The Gents Giovanni Emporio Armani Watch is a stylish fashion accessory that can be paired with any outfit, whether you’re at work or at play. ",
    "features": [
      "Water-resistant to 30m so you don’t have to remove it when washing your hands",
      "Long lasting and rust-resistant 44mm stainless steel case",
      "Luminescent hands, allowing for easy time-reading in the dark",
      "Powered by a quartz watch movement for superb time accuracy"
    ]
  },
  {
    "name": "Ladies Emporio Armani Watch",
    "company": "Emporio Armani",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100051075/main/large/AR11517.jpg",
    "gender": "Woman",
    "price": 287.0,
    "description": "Emporio Armani AR11517 is a beautiful and interesting Ladies watch. Case is made out of Stainless Steel, which stands for a high quality of the item and the Silver dial gives the watch that unique look. 30 metres water resistance will protect the watch and allows it to be worn in scenarios where it is likely to be splashed but not immersed in water. It can be worn while washing your hands and will be fine in rain. We ship it with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Mens Emporio Armani Watch",
    "company": "Emporio Armani",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100047694/main/large/AR60062.jpg",
    "gender": "Man",
    "price": 359.0,
    "description": "Emporio Armani 42mm watch features a black sunray with cut out dial, at least 50% recycled stainless steel case, automatic movement and black silicone strap."
  },
  {
    "name": "Emporio Armani Watch AR11453",
    "company": "Emporio Armani",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100045615/main/large/AR11453.jpg",
    "gender": "Man",
    "price": 215.0,
    "description": "Emporio Armani AR11453 is an amazing and very impressive Gents watch. Case material is Stainless Steel while the dial colour is Black. The features of the watch include (among others) a chronograph. 30 metres water resistance will protect the watch and allows it to be worn in scenarios where it is likely to be splashed but not immersed in water. It can be worn while washing your hands and will be fine in rain. We ship it with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Ladies Emporio Armani Watch AR11415",
    "company": "Emporio Armani",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100043783/main/large/AR11415.jpg",
    "gender": "Woman",
    "price": 255.0,
    "description": "Emporio Armani AR11415 is a beautiful and trendy Ladies watch. Material of the case is Stainless Steel while the dial colour is Silver. 30 metres water resistancy will protect the watch and allows it to be worn in scenarios where it is likely to be splashed but not immersed in water. It can be worn while washing your hands and will be fine in rain. We ship it with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Mans Emporio Armani Watch AR11299",
    "company": "Emporio Armani",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100036400/main/large/AR11299.jpg",
    "gender": "Man",
    "price": 312.0,
    "description": "Emporio Armani Gianni T-Bar AR11299 is a practical and special Gents watch. Case material is Stainless Steel and the Black dial gives the watch that unique look. The features of the watch include (among others) a date function. 30 metres water resistancy will protect the watch and allows it to be worn in scenarios where it is likely to be splashed but not immersed in water. It can be worn while washing your hands and will be fine in rain. The watch is shipped with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Boss Watch 1513802",
    "company": "BOSS",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100047551/main/large/1513802.jpg",
    "gender": "Man",
    "price": 359.0,
    "description": "Hugo Boss Metronome 1513802 is an amazing and special Gents watch. Material of the case is Stainless Steel while the dial colour is Black. The features of the watch include (among others) a chronograph. This model has got 50 metres water resistancy - it can be submerged in water for periods, so can be used for swimming and fishing. It is not recommended for high impact water sports. The watch is shipped with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Mens BOSS Santiago Two Tone & Green Watch",
    "company": "BOSS",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100040557/main/large/1513872_FRONT_1.jpg",
    "gender": "Man",
    "price": 312.0,
    "description": "BOSS gents watch from the Santiago family. Featuring a 44mm stainless steel case with gold IP bezel, dual time movement, green dial and two-tone gold IP and stainless steel bracelet. Water resistant to 5ATM"
  },
  {
    "name": "Boss Gala Watch 1502557",
    "company": "BOSS",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100037979/main/large/1502557_FRONT_1_1.jpg",
    "gender": "Woman",
    "price": 269.0,
    "description": "BOSS ladies watch from the Gala family. Featuring a 28mm gold IP case with crystal set bezel, white Mother of Pearl dial and gold IP bracelet. Water resistant to 3ATM"
  },
  {
    "name": "Boss Praise Watch 1502547",
    "company": "BOSS",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100036083/main/large/1502547_LRG_rgb_Web.jpg",
    "gender": "Woman",
    "price": 190.0,
    "description": "BOSS ladies watch from the Praise family. Featuring a 36mm gold IP case, gold dial decorated with a ring of crystals, gold IP slim mesh bracelet and mesh clasp. Water resistant to 3ATM."
  },
  {
    "name": "Mens BOSS Pilot Edition Chronograph Black Watch",
    "company": "BOSS",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100040553/main/large/1513854_FRONT_1_1.jpg",
    "gender": "Man",
    "price": 369.0,
    "description": "BOSS gents watch from the Pilot Edition Chrono family. Featuring a 44mm black IP stainless steel case with slide-rule bezel, retrograde chronograph movement, black dial and black IP stainless steel bracelet. Water resistant to 5ATM."
  },
  {
    "name": "Boss Flawless Watch 1502551",
    "company": "BOSS",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100037982/main/large/1502551_FRONT_1.jpg",
    "gender": "Man",
    "price": 249.0,
    "description": "Hugo Boss Flawless 1502551 is an amazing watch from Flawless collection. Material of the case is Plated Stainless Steel while the dial colour is Silver. 30 metres water resistancy will protect the watch and allows it to be worn in scenarios where it is likely to be splashed but not immersed in water. It can be worn while washing your hands and will be fine in rain. We ship it with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Olivia Burton Lucky Bee White MOP Demi Dial & Gold Bracelet Watch OB16FB18",
    "company": "Olivia Burton",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100036675/main/large/OB16FB18_1.jpg",
    "gender": "Woman",
    "price": 159.0,
    "description": "Our iconic Lucky Bee has had a sparkly reinvention with a luxurious new mother of pearl dial finish. Housed in glistening gold the 34mm pearl dial sets off the beauty of the detailed body and wings perfectly - this little bee is not afraid to shine."
  },
  {
    "name": "Ladies Olivia Burton Mermaid Tail Watch",
    "company": "Olivia Burton",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100034925/main/large/OB16US46_1.jpg",
    "gender": "Woman",
    "price": 118.0,
    "description": "If you’ve always wanted to channel some mermaid vibes, here’s how. As you can probably tell, Olivia Burton must have had a lot of fun designing this mermaid-tail inspired timepiece. A shimmery rainbow of scalloped scales adorns the bold Demi dial, all set off by contemporary silver casing and mesh strap. This is guaranteed to bring a smile every time you look down at your wrist.",
    "features": [
      "Sultry in silver",
      "Delicate and pretty mesh bracelet strap",
      "A mermaid in disguise",
      "Part of Olivia Burton`s Under The Sea collection"
    ]
  },
  {
    "name": "Ladies Olivia Burton Dancing Dragonfly Watch",
    "company": "Olivia Burton",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100034009/main/large/OB16GB01_1.jpg",
    "gender": "Woman",
    "price": 139.0,
    "description": "Meet a mesmerizing member of Olivia Burton`s bug family - the dancing dragonfly. The sun-dappled dial is reminiscent of warm summer days, beautifully complemented by a Pearl Pink strap. Rose gold 3D dragonflies set with crystals dance across the Midi dial. These beautiful little bugs are all about new beginnings, so what better way to kick off your watch collection?",
    "features": [
      "Pretty ivory leather watch strap",
      "Delicate dragonflies for a decadent finish",
      "Regal rose gold case",
      "All about new beginnings"
    ]
  },
  {
    "name": "Ladies Michael Kors Janelle Chronograph Watch",
    "company": "Michael Kors",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100039654/main/large/MK7097_main.jpg",
    "gender": "Woman",
    "price": 389.0,
    "description": "Both blingy and bouji, this Michael Kors Janelle Watch will have your wrist glistening with glory. The Janelle features a gold diamante-studded strap and matching dial, proving all the razzle dazzle you will ever need. Featuring three subdials, characteristic of a chronograph watch, the highly adorned face presents its hour markers as batons, with Roman numerals utilised at 12 o`clock.",
    "features": [
      "Rust-resistant stainless steel case",
      "Metal bracelet strap for great security",
      "Powerful quartz movement for ultimate time precision",
      "Date window, so the wearer always has the date right at their wrist",
      "Water-resistant to 50m, so can be worn whilst shallow swimming"
    ]
  },
  {
    "name": "Ladies Michael Kors Runway Chronograph Watch",
    "company": "Michael Kors",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/99935381/main/large/MK5055update.jpg",
    "gender": "Woman",
    "price": 239.0,
    "description": "Designed straight off the runway, staying true to its name, the Runway by Michael Kors is a watch exuberating seductive styling in the addition to great functionality. Featuring a multi-dial clock face, chronograph and date function, the Runway is much more than just a fashion piece; helping you always stay on time.",
    "features": [
      "Water-resistant to 100m, great for swimming",
      "Powered by a quartz watch movement for superb time accuracy",
      "Date function so you always have the date at your wrist",
      "Chronograph function for elapsed time measurement, adding functionality"
    ]
  },
  {
    "name": "Mens Michael Kors Layton Watch",
    "company": "Michael Kors",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100039213/main/large/MK8816.jpg",
    "gender": "Man",
    "price": 176.0,
    "description": "This eye-catching accessory is water resistant to 50 metres, so it can be worn for light swimming and can even handle being submerged for a short while. It keeps superb time thanks to its powerful quartz movement, and the dial is protected by hardwearing mineral glass. The jet-black case and dial contrast perfectly with the vibrant gold tones of the dial and bracelet. The dial features chunky gold hour baton markers and luminous hands, and there’s a date window at 6 o’clock",
    "features": [
      "Water-resistant to 50m so you don’t have to remove it when washing your hands",
      "Bold black-and-gold colour scheme for maximum bling factor",
      "Powered by a quartz watch movement for superb time accuracy"
    ]
  },
  {
    "name": "Mens Michael Kors Hutton Watch",
    "company": "Michael Kors",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100047041/main/large/MK8956.jpg",
    "gender": "Man",
    "price": 153.0,
    "description": "Michael Kors Hutton MK8956 is an amazing and handsome Gents watch. Material of the case is Stainless Steel, which stands for a high quality of the item while the dial colour is Black. 100 metres water resistance will protect the watch and allows it to get submerged in the water for everyday usage including swimming, but not high impact water sports. The watch is shipped with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Ladies Michael Kors Parker Chronograph Watch",
    "company": "Michael Kors",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100040669/main/large/MK6917.jpg",
    "gender": "Woman",
    "price": 236.0,
    "description": "Michael Kors Parker MK6917 is an incredible interesting Ladies watch. Case material is Stainless Steel and the White dial gives the watch that unique look. The features of the watch include (among others) a chronograph. This model has got 50 metres water resistancy - it can be submerged in water for periods, so can be used for swimming and fishing. It is not recommended for high impact water sports. We ship it with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Gents Michael Kors Everest Watch",
    "company": "Michael Kors",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100051182/main/large/MK9079.jpg",
    "gender": "Man",
    "price": 219.0,
    "description": "Michael Kors Everest MK9079 is an amazing and very impressive Gents watch. Case is made out of Stainless Steel and the Blue dial gives the watch that unique look. In regards to the water resistance, the watch has a water resistance of 100 metres. This makes it suitable for swimming, but not high impact water sports. We ship it with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Mens Michael Kors Lexington Chronograph Watch",
    "company": "Michael Kors",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100025887/main/large/MK8602_main.jpg",
    "gender": "Man",
    "price": 238.0,
    "description": "The stylish black-and-silver colour scheme makes a sharp statement. The rippled stainless-steel case houses a jet-black dial with chunky hour baton markers and hands, with a Roman numeral at 12 o’clock. The chunky metal bracelet proves the finishing touch to this stylish timepiece.",
    "features": [
      "Water resistant to 50 metres, so can be submerged in water for short periods",
      "Chronograph function for elapsed time measurement, adding functionality",
      "Powered by a quartz watch movement for superb time accuracy"
    ]
  },
  {
    "name": "Mens Certina DS Podium Automatic Automatic Watch",
    "company": "Certina",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100001790/main/large/c001.407.16.057.00_mres_8250-1465558526-516.jpg",
    "gender": "Man",
    "price": 595.0,
    "description": "Certina DS Podium C0014071605700 is a functional and special Gents watch. Case material is Stainless Steel, which stands for a high quality of the item and the Black dial gives the watch that unique look. The features of the watch include (among others) a date function. 100 metres water resistancy will protect the watch and allows it to get submerged in the water for everyday usage including swimming, but not high impact water sports. The watch is shipped with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Certina DS PH200M Powermatic Watch C0364071105001",
    "company": "Certina",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100037166/main/large/C036.407.11.050.01_SLD.jpg",
    "gender": "Man",
    "price": 915.0,
    "description": "Certina DS PH200M C0364071105001 is a practical and attractive Gents watch from Aqua collection. Material of the case is Stainless Steel, which stands for a high quality of the item and the Black dial gives the watch that unique look. The features of the watch include (among others) a date function. This model has got 200 metres water resistancy - it can be used for professional marine activity, skin diving and high impact water sports, but not deep sea or mixed gas diving. We ship it with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Mens Certina DS Podium Chrono auto Automatic Chronograph Automatic Watch",
    "company": "Certina",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100041543/main/large/C0344271608701_SLD_1.jpg",
    "gender": "Man",
    "price": 870.0,
    "description": "Certina DS Podium Chrono auto C0344271608701 is an amazing and attractive Gents watch from Sport collection. Case material is Stainless Steel, which stands for a high quality of the item and the Grey dial gives the watch that unique look. The features of the watch include (among others) a chronograph. 100 metres water resistancy will protect the watch and allows it to get submerged in the water for everyday usage including swimming, but not high impact water sports. The watch is shipped with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Ladies Certina DS Dream Watch",
    "company": "Certina",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100040815/main/large/C021.810.16.057.00_SLD.jpg",
    "gender": "Woman",
    "price": 285.0,
    "description": "Certina DS Dream C0218101605700 is an incredible interesting Ladies watch from DS Dream collection. Case material is Stainless Steel while the dial colour is Black. 100 metres water resistancy will protect the watch and allows it to get submerged in the water for everyday usage including swimming, but not high impact water sports. We ship it with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Ladies Certina DS Queen Watch ",
    "company": "Certina",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100044215/main/large/1.jpg",
    "gender": "Woman",
    "price": 205.0,
    "description": "Certina DS Queen C0182101112000 is a beautiful and attractive Ladies watch from DS Queen collection. Case material is Stainless Steel and the Black mother of pearl dial gives the watch that unique look. In regards to the water resistance, the watch has a water resistance of 100 metres. This makes it suitable for swimming, but not high impact water sports. We ship it with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Mens Certina DS Podium Chrono auto Automatic Chronograph Automatic Watch",
    "company": "Certina",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100041544/main/large/C0344273603700_SLD_1.jpg",
    "gender": "Man",
    "price": 843.0,
    "description": "Certina DS Podium Chrono auto C0344273603700 is a practical and handsome Gents watch from Sport collection. Case is made out of Stainless Steel and the Silver dial gives the watch that unique look. The features of the watch include (among others) a chronograph. This model has 100 metres water resistancy - it is suitable for swimming, but not high impact. We ship it with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Mens LLARSEN Nor Chronograph Watch",
    "company": "LLARSEN",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100033890/main/large/149SDS3-MS20.jpg",
    "gender": "Man",
    "price": 217.0,
    "description": "LLARSEN Nor 149SDS3-MS20 is a functional and special Gents watch from LW49 collection. Case material is Stainless Steel while the dial colour is Blue. The features of the watch include (among others) a chronograph. 50 metres water resistancy will protect the watch and allows it to be submerged in water for periods, so can be used for swimming and fishing. It is not reccomended for high impact water sports. The watch is shipped with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Ladies LLARSEN Lykke Watch",
    "company": "LLARSEN",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100034165/main/large/145SBS3_SCOAL8.jpg",
    "gender": "Woman",
    "price": 122.0,
    "description": "LLARSEN Lykke 145SBS3-SCOAL8 is a beautiful and attractive Ladies watch. Material of the case is Stainless Steel, which stands for a high quality of the item and the Black dial gives the watch that unique look. In regards to the water resistance, the watch has got a resistancy up to 30 metres. It means it can be worn in scenarios where it is likely to be splashed but not immersed in water. It can be worn while washing your hands and will be fine in rain. The watch is shipped with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Mens LLARSEN Hugo Watch",
    "company": "LLARSEN",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100037569/main/large/180GDG3-GBLUE20.jpg",
    "gender": "Man",
    "price": 170.0,
    "description": "LLARSEN Hugo 180GDG3-GBLUE20 is a practical and attractive Gents watch. Material of the case is Stainless Steel, which stands for a high quality of the item while the dial colour is Blue. This model has got 50 metres water resistancy - it can be submerged in water for periods, so can be used for swimming and fishing. It is not recommended for high impact water sports. We ship it with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Ladies LLARSEN Caroline Watch",
    "company": "LLARSEN",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100044149/main/large/146GTG3-MSG3-12.jpg",
    "gender": "Woman",
    "price": 156.0,
    "description": "LLARSEN Caroline 146GTG3-MSG3-12 is a beautiful and interesting Ladies watch from Novelties collection. Case is made out of Stainless Steel and the Green dial gives the watch that unique look. This model has got 30 metres water resistancy - it can be worn in scenarios where it is likely to be splashed but not immersed in water. It can be worn while washing your hands and will be fine in rain. We ship it with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Ladies LLARSEN Noa Watch",
    "company": "LLARSEN",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100044152/main/large/148GWB3-GINK18.jpg",
    "gender": "Woman",
    "price": 191.0,
    "description": "LLARSEN Noa 148GWB3-GINK18 is a beautiful and eye-catching Ladies watch from Novelties collection. Case is made out of Stainless Steel and the White dial gives the watch that unique look. This model has got 50 metres water resistancy - it can be submerged in water for periods, so can be used for swimming and fishing. It is not recommended for high impact water sports. We ship it with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Ladies Versus Versace Versus Kirstenhof Watch",
    "company": "Versus Versace",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100032828/main/large/VSP491519.jpg",
    "gender": "Woman",
    "price": 171.0,
    "description": "Versus Versace Kirstenhof VSP491519 is a beautiful and interesting Ladies watch from Dressy collection. Case is made out of Stainless Steel and the Silver dial gives the watch that unique look. This model has got 30 metres water resistancy - it can be worn in scenarios where it is likely to be splashed but not immersed in water."
  },
  {
    "name": "Versus Versace Watch",
    "company": "Versus Versace",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100048957/main/large/VWS790617.jpg",
    "gender": "Woman",
    "price": 240.0
  },
  {
    "name": "Mens Versus Versace Versus Aberdeen Ext. Watch",
    "company": "Versus Versace",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100032804/main/large/VSPLO0819_1.jpg",
    "gender": "Man",
    "price": 198.0,
    "description": "Versus Versace Aberdeen Ext. VSPLO0819 is an amazing and attractive Gents watch from Urban Generation collection. Material of the case is Stainless Steel, which stands for a high quality of the item while the dial colour is Grey. In regards to the water resistance, the watch has got a resistancy up to 50 metres. It means it can be submerged in water for periods, so can be used for swimming and fishing. It is not reccomended for high impact water sports. The watch is shipped with an original box and a guarantee from the manufacturer."
  },
  {
    "name": "Versus Versace Watch",
    "company": "Versus Versace",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100048958/main/large/VSPET0519.jpg",
    "gender": "Man",
    "price": 190.0
  },
  {
    "name": "Mens Versus Versace Versus Barbes Watch",
    "company": "Versus Versace",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100032811/main/large/VSPLN1119.jpg",
    "gender": "Man",
    "price": 144.0,
    "description": "Versus Versace Barbés VSPLN1119 is a practical and special Gents watch from Urban Generation collection. Material of the case is Stainless Steel and the Black dial gives the watch that unique look. This model has got 30 metres water resistancy - it can be worn in scenarios where it is likely to be splashed but not immersed in water. It can be worn while washing your hands and will be fine in rain."
  },
  {
    "name": "Mens Festina Automatic Automatic Watch",
    "company": "Festina",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100040314/main/large/f20535_12.jpg",
    "gender": "Man",
    "price": 195.0
  },
  {
    "name": "Mens Festina Divers Watch - 200M Water resistant- with Silicone strap",
    "company": "Festina",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100051967/main/large/P_1_f20662_1.jpg",
    "gender": "Man",
    "price": 139.0,
    "description": "Festina Diver F20662/1 is an amazing and special Gents watch. Case is made out of Stainless Steel and the Blue dial gives the watch that unique look. In regards to the water resistance, the watch has got a water resistance of 200 metres. This means it can be used for professional marine activity, skin diving and high impact water sports, but not deep sea or mixed gas diving."
  },
  {
    "name": "Ladies Festina Solar Watch",
    "company": "Festina",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100050599/main/large/P_1_f20659_2.jpg",
    "gender": "Woman",
    "price": 170.0,
    "description": "Festina F20659/2 is an incredible attractive Ladies watch from Solar Energy collection. Material of the case is Stainless Steel and the Blue Mother of pearl dial gives the watch that unique look. 50 metres water resistancy will protect the watch and allows it to be submerged in water for periods, so can be used for swimming and fishing. It is not recommended for high impact water sports. "
  },
  {
    "name": "Mens Festina Automatic Skeleton Watch with Steel Bracelet",
    "company": "Festina",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100050266/main/large/P_1_f20630_1.jpg",
    "gender": "Man",
    "price": 265.0,
    "description": "Festina Skeleton Automatic F20630/1 is a practical and very impressive Gents watch. Case material is Stainless Steel and the Skeleton dial gives the watch that unique look. In regards to the water resistance, the watch has got a resistancy up to 50 metres. It means it can be submerged in water for periods, so can be used for swimming and fishing. It is not recommended for high impact water sports."
  },
  {
    "name": "Mens Maurice Lacroix Aikon Automatic Automatic Watch",
    "company": "Maurice Lacroix",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100032158/main/large/AI6008_SS001_331_1.jpg",
    "gender": "Man",
    "price": "1,990.00"
  },
  {
    "name": "Mens Junghans FORM C Chronograph Watch",
    "company": "Junghans",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100024607/main/large/041_4876_00_RGB.jpg",
    "gender": "Man",
    "price": "540.00"
  },
  {
    "name": "Marathon Government Search & Rescue Tritium Night Vision Watch",
    "company": "Marathon",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100049544/main/large/WW194007SS-0130-1-Hero.jpg",
    "gender": "Man",
    "price": 1055.0,
    "description": "Built in accordance with U.S Government specification, and commonly known as the TSAR (for Tritium Search and Rescue), the Marathon Large Diver’s watch allows you to dive deeper, thanks to its 1000m Water resistance capabilities and its screw-down crown. It truly was designed for divers and built to withstand the harshest and most challenging conditions. It has been crafted with a Stainless Steel case and powered by a high-torque Swiss ETA movement, which is reliable and highly accurate."
  },
  {
    "name": "Seiko Prospex Alpinist Watch SPB210J1",
    "company": "Seiko",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100041810/main/large/SPB210J1_1.jpg",
    "gender": "Man",
    "price": 750.0,
    "description": "Seiko Prospex Alpinist SPB210J1 is a practical and attractive Gents watch. Case material is Stainless Steel while the dial colour is Bronze. This model has got 200 metres water resistancy - it can be used for professional marine activity, skin diving and high impact water sports, but not deep sea or mixed gas diving. "
  },
  {
    "name": "Mens Maurice Lacroix Automatic Automatic Watch",
    "company": "Maurice Lacroix ",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100038455/main/large/AI6058_SS002_330_2.jpg",
    "gender": "Man",
    "price": 2280.0
  },
  {
    "name": "Mens Maurice Lacroix Aikon Chronograph Watch",
    "company": "Maurice Lacroix",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100042523/main/large/AI1018_SS001_432_4.png",
    "gender": "Man",
    "price": 1350.0,
    "description": "Maurice Lacroix Aikon AI1018-SS001-432-4 is a practical and handsome Gents watch from Aikon collection. Material of the case is Stainless Steel and the Blue dial gives the watch that unique look. The features of the watch include (among others) a chronograph. This model has 100 metres water resistancy - it is suitable for swimming, but not high impact."
  },
  {
    "name": "Seiko Prospex STO Watch SRPF77K1",
    "company": "Seiko",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100041803/main/large/SRPF77K1_1.jpg",
    "gender": "Man",
    "price": 550.0,
    "description": "Seiko Prospex STO SRPF77K1 is an amazing and handsome Gents watch. Material of the case is Stainless Steel, which stands for a high quality of the item while the dial colour is Blue. This model has got 200 metres water resistancy - it can be used for professional marine activity, skin diving and high impact water sports, but not deep sea or mixed gas diving."
  },
  {
    "name": "Mens Baume & Mercier Clifton Baumatic Automatic Automatic Watch",
    "company": "Baume & Mercier",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100032430/main/large/M0A104672.jpg",
    "gender": "Man",
    "price": 2750.0,
    "description": "Baume & Mercier Clifton Baumatic M0A10467 is an amazing and attractive Gents watch from Clifton collection. Case is made out of Stainless Steel, which stands for a high quality of the item and the Blue dial gives the watch that unique look. The features of the watch include (among others) a date function. 50 metres water resistancy will protect the watch and allows it to be submerged in water for periods, so can be used for swimming and fishing. It is not reccomended for high impact water sports."
  },
  {
    "name": "Mens Maurice Lacroix Pontos Automatic Automatic Watch",
    "company": "Maurice Lacroix",
    "img": "https://d1rkccsb0jf1bk.cloudfront.net/products/100037265/main/large/PT6358_SS002_430_1.jpg",
    "gender": "Man",
    "price": 1520.0,
    "description": "Maurice Lacroix Pontos PT6358-SS002-430-1 is an amazing and very impressive Gents watch from Potos Day - Date collection. Material of the case is Stainless Steel while the dial colour is Blue. In regards to the water resistance, the watch has a water resistance of 100 metres. This makes it suitable for swimming, but not high impact water sports."
  }
]
